{
    "input_folder": "Select the directory containing your input MP4 videos. The script expects '_splatted4' for quad inputs (Original, Depth, Mask, Warped) or '_splatted2' for dual inputs (Mask, Warped).",
    "output_folder": "Choose the directory where the processed (inpainted) videos will be saved. Output will be Side-by-Side (original | inpainted) for quad inputs, or only the inpainted right eye for dual inputs.",
    "num_inference_steps": "Number of denoising steps for the video generation process. Higher values generally lead to better quality but increase processing time. Default:5 ",
    "tile_num": "Number of spatial tiles (e.g., 2 means 2x2 grid) to split each video frame into. Useful for processing high-resolution videos with limited GPU memory. Set to 1 to disable tiling. Default:1",
    "frames_chunk": "The number of frames processed together in a single temporal batch. Adjust based on your GPU memory. Larger chunks can be faster but require more VRAM. Hallucination is more likely with larger chunks. Default:23",
    "frame_overlap": "The number of frames that temporally overlap between consecutive processing chunks. These overlapping frames from the previous generated output and original input are smoothly blended to condition the start of the current chunk, reducing visual glitches. Default:3",
    "original_input_blend_strength": "Controls how much the original warped input (1.0) versus the previous generated inpainted frame (0.0) influences the blend during temporal overlap. 0.0 means hallucinations but smoother transitions by relying on previous generated frames while 1.0 will use the splatted source to drive new frames. Default:0.8",
    "offload_type": "Determines how parts of the model are moved to CPU memory to reduce GPU VRAM usage. 'model' offloads entire components, 'sequential' offloads layers one by one, 'none' keeps everything on GPU.",
    "general_help": "This is a GUI for StereoCrafter, a Stable Video Diffusion Inpainting Pipeline. It takes warped videos (e.g., from depth_splatting_gui.py) and fills in occluded areas. Input videos are expected to be either 'quad-splatted' (original, depth, mask, warped) or 'dual-splatted' (mask, warped). Outputs are either Side-by-Side (original | inpainted) or just the inpainted right eye, respectively. Adjust 'Tile Number' and 'Frames Chunk' if you encounter out-of-memory errors. 'Frame Overlap' helps smooth transitions between processed chunks. Use 'Original Input Bias' to balance consistency with the generated past vs. adherence to the original video source."
}