{
    "input_source_clips": "Path to the folder containing your input video clips (MP4, AVI, MOV, MKV).",
    "input_depth_maps": "Path to the folder containing your pre-rendered depth maps. Depth maps should be named 'videoname_depth.mp4' matching your input videos.",
    "output_splatted": "Path to the folder where the splatted output videos will be saved.",
    "set_pre_res": "Enable to resize input videos to a specific resolution before processing. This affects both the video frames and the depth maps (if 'Resize Depthmap' is enabled). This option maybe removed and left permanently on in the future",
    "pre_res_width": "Target width for pre-processing input videos if 'Set Pre-processing Resolution' is enabled.",
    "pre_res_height": "Target height for pre-processing input videos if 'Set Pre-processing Resolution' is enabled.",
    "match_depth_res": "If checked, loaded depth maps will be resized (interpolated) to match the resolution of the processed input video frames.",
    "max_disp": "Maximum disparity value as a percentage of the video's width x 20. Higher values result in more extreme parallax effects (depth shift). Example: '30.0' means a maximum of 1.5% shift horizontally at the forground.",
    "batch_size": "Number of frames to process in a single batch during the forward warping (splatting) stage. Adjust based on your GPU's VRAM; lower values use less VRAM but can be slower. Default:10",
    "dual_output": "If checked, the output video will show two panels: the generated occlusion mask on the left and the warped (right-eye view) video on the right. If unchecked, it will generate a 2x2 grid: Original | DepthVis (Top), Mask | Warped (Bottom).",
    "enable_low_res_output": "If checked, an additional, smaller resolution output video will be generated alongside the main output. This is useful for quickly previewing results or for specific downstream uses. IT IS NOT RECOMMENDED to use this for inpainting as the downscaled mask will not produce a clean result. This option maybe removed in the future.",
    "low_res_width": "The target width for the second, downscaled output video.",
    "low_res_height": "The target height for the second, downscaled output video.",
    "start_button": "Starts the batch processing: loads videos, depth maps, and performs the depth splatting.",
    "stop_button": "Stops the currently running processing task cleanly.",
    "exit_button": "Saves the current GUI settings to 'config_splat.json' and closes the application.",
    "input_source_clips_folder": "Browse for a folder containing multiple video clips to process in batch.",
    "input_source_clips_file": "Select a single video clip file to process.",
    "input_depth_maps_folder": "Browse for a folder containing corresponding depth maps (e.g., video_name_depth.mp4/npz) for batch processing.",
    "input_depth_maps_file": "Select a single depth map file corresponding to the selected source video.",
    "convergence_point": "Set the normalized depth value (0.0 to 1.0) that will appear stationary (zero horizontal shift). 0.0 is closest, 1.0 is farthest. This defines the 'screen plane' or 'convergence plane' for the stereo effect.",
    "enable_autogain": "If enabled, depth maps are scaled to the full 0-1 range based on their min/max values in each video."
}