{
    "input_source_clips": "Path to the folder containing your input video clips (MP4, AVI, MOV, MKV).",
    "input_source_clips_folder": "Browse for a folder containing multiple video clips to process in batch.",
    "input_source_clips_file": "Select a single video clip file to process.",
    "input_depth_maps": "Path to the folder containing your pre-rendered depth maps. Depth maps should be named 'videoname_depth.mp4' matching your input videos.",
    "input_depth_maps_folder": "Browse for a folder containing corresponding depth maps (e.g., video_name_depth.mp4/npz) for batch processing.",
    "input_depth_maps_file": "Select a single depth map file corresponding to the selected source video.",
    "output_splatted": "Path to the folder where the splatted output videos will be saved.",
    
    "enable_full_res": "When checked, will generate a splatted video at the original resolution of the input video. Use this for blending over the inpaint.",
    "full_res_batch_size": "The number of frames to process simultaneously when generating the full-resolution output. A higher value uses more VRAM but can be faster. Adjust based on your GPU's memory.",
    "enable_low_res": "When checked, will generate a splatted video of specified resolution. Use this for inpainting.",
    "low_res_width": "The target width for the low-resolution output. The input video and depth maps will be resized to this width for the low-resolution pass.",
    "low_res_height": "The target height for the low-resolution output. The input video and depth maps will be resized to this height for the low-resolution pass.",
    "low_res_batch_size": "The number of frames to process simultaneously when generating the low-resolution output. Can often be higher than the full-resolution batch size due to lower memory requirements.",
    
    "depth_gamma": "Applies a non-linear adjustment to the depth map before normalization. above 1.0 moves the midground towards the camera. Below 1.0 move further away. Set to 1.0 to disable.",
    "depth_dilate_size": "Dilate or blur the foregound object if you see jagged edge on the left of the subject. Must be an odd number (3, 5, 7, etc.) or 0 to disable.",
    "depth_blur_size": "Blur or dilate the foregound object if you see jagged edge on the left of the subject. Must be an odd number (3, 5, 7, etc.) or 0 to disable. Sigma is automatically calculated as Size/6.",
    
    "sidecar_gamma_toggle": "If checked, will give automated control from sidecar file to set gamma values & overiding the GUI for that specific video.",
    "sidecar_blur_dilate_toggle": "If checked, will give automated control from sidecar file to set Dilate and Blur values & overiding the GUI for that specific video.",
    
    "max_disp": "Maximum disparity value as a percentage of the video's width x 20. Higher values result in more extreme parallax effects (depth shift). Example: '30.0' means a maximum of 1.5% shift horizontally at the forground.",
    "convergence_point": "Set to 1.0 will place depth inside the screen. 0.0 will give 100% pop out. StereoCrafter Default = 0.5, Recommend 0.8.",
    "process_length": "Set how many frames to process before moving on to the next video, used for testing. -1 will process all frames.",
    "dual_output": "If checked, will generate dual panel for inpaint right eye only. Unchecked will generate quad panel for complete low-res stereo SBS after inpainting. Use this(Dual) to save on resources and manual blending.",
    "no_normalization": "Use this only if your scene is too long and you have split your video/depthmap into shorter lengths to be rejoined after processing. Otherwise your cut scenes depth will not align",
    "output_crf": "Constant Rate Factor (CRF) for H.264/H.265 video encoding. Lower values mean higher quality and larger file sizes. A good starting point is 18 for high quality, 23 for good quality. Range is typically 0-51.",
    "auto_convergence_toggle": "EXPERIMENTAL: Simple auto convergence derived from 75% center region and averaged throughout the clip.",
   
    "start_button": "Starts the batch processing: loads videos, depth maps, and performs the depth splatting.",
    "stop_button": "Stops the currently running processing task cleanly.",
    "exit_button": "Saves the current GUI settings to 'config_splat.json' and closes the application."
}